src: Update README
