--- a/src/lib/README.md
+++ b/src/lib/README.md
@@ -1,35 +1,111 @@
+
+### Application
+
+```mermaid
+classDiagram
+  class Application {
+    +static createInstance()
+    -bool mHasGui
+    -std::shared_ptr<lib::IFactory> mFactory
+    -bool mLoadedWindow
+    -std::shared_ptr<IProject> mProject
+    -std::shared_ptr<StorageCache> mStorageCache
+    -std::shared_ptr<MainView> mMainView
+    -std::shared_ptr<IDECommunicationController> mIdeCommunicationController
+  }
+
+  Application *-- IFactory
+  Application *-- IViewFactory
+  Application *-- INetworkFactory
+  Application *-- ITaskManager
+  Application *-- IMessageQueue
+  Application *-- StorageCache
 ```
 
-## Application
-```plantuml
-@startuml
-!include https://raw.githubusercontent.com/patrik-csak/one-dark-plantuml-theme/v1.0.1/theme.puml
+### Project
 
-class Application {
-+ static createInstance()
-- mHasGui : bool
-- mFactory : std::shared_ptr<lib::IFactory>
-- mLoadedWindow : bool 
-- mProject : std::shared_ptr<IProject>
-- mStorageCache : std::shared_ptr<StorageCache>
-- mMainView : std::shared_ptr<MainView>
-- mIdeCommunicationController : std::shared_ptr<IDECommunicationController>
-}
@@
 
-Application *-- IFactory
-Application *-- IViewFactory
-Application *-- INetworkFactory
-Application *-- ITaskManager
-Application *-- IMessageQueue
-Application *-- StorageCache
@@
 
-@enduml
@@
 ```
